Repository: Mu-L/Off-Day
Catalog: Off Day/Localizable.xcstrings
Source language: en
Languages: ja, ko, zh_hans, zh_hk

# more.section.log
source: Log
ja: ログ
ko: 로그
zh_hans: 日志
zh_hk: 日誌

source: Next Off Day Detail after ${date}
ja: ${date}以降の次の休日の詳細
ko: ${date} 이후 다음 휴일 상세 정보
zh_hans: 获取 ${date}后第一个休息日的详情
zh_hk: 獲取 ${date}後第一個休息日的詳情

source: Next Work Day Detail after ${date}
ja: ${date}以降の次の出勤日の詳細
ko: ${date} 이후 다음 근무일 상세 정보
zh_hans: 获取 ${date}后第一个工作日的详情
zh_hk: 獲取 ${date}後第一個工作日的詳情

# notification.type.customDay.offDay.text, %@
source: Tomorrow(%@) is Custom Off Day.
ja: 明日（%@）はカスタム休日です。
ko: 내일(%@)은 사용자 지정 휴일입니다.
zh_hans: 明天（%@）是自定义休息日。
zh_hk: 明天（%@）是自定義休息日。

# notification.type.customDay.offDay.title
source: Custom Off Day Notification
ja: カスタム休日通知
ko: 사용자 지정 휴일 알림
zh_hans: 自定义休息日通知
zh_hk: 自定義休息日通知

# notification.type.customDay.workDay.text, %@
source: Tomorrow(%@) is Custom Work Day.
ja: 明日（%@）はカスタム出勤日です。
ko: 내일(%@)은 사용자 지정 근무일입니다.
zh_hans: 明天（%@）是自定义工作日。
zh_hk: 明天（%@）是自定義工作日。

# notification.type.customDay.workDay.title
source: Custom Work Day Notification
ja: カスタム出勤日通知
ko: 사용자 지정 근무일 알림
zh_hans: 自定义工作日通知
zh_hk: 自定義工作日通知

# notification.type.publicDay.offDay.text, %@, %@
source: Tomorrow(%1$@) %2$@, is Public Off Day.
ja: 明日（%1$@）%2$@は祝日です。
ko: 내일(%1$@) %2$@은(는) 공휴일입니다.
zh_hans: 明天(%1$@) %2$@，是公共假期。
zh_hk: 明天(%1$@) %2$@，是公共假期。

# notification.type.publicDay.offDay.title
source: Public Off Day Notification
ja: 祝日通知
ko: 공휴일 알림
zh_hans: 公共假期通知
zh_hk: 公共假期通知

# notification.type.publicDay.workDay.text, %@, %@
source: Tomorrow(%1$@) %2$@, is Public Work Day.
ja: 明日（%1$@）%2$@は振替出勤日です。
ko: 내일(%1$@) %2$@은(는) 공휴일 템플릿의 근무일입니다.
zh_hans: 明天(%1$@) %2$@，是公共调班日。
zh_hk: 明天(%1$@) %2$@，是公共調班日。

# notification.type.publicDay.workDay.title
source: Public Work Day Notification
ja: 振替出勤日通知
ko: 대체 근무일 알림
zh_hans: 公共调班日通知
zh_hk: 公共調班日通知

# notification.type.template.text, %i
source: Your Public Holiday Template expires in %i days. Please update it now.
ja: 祝日テンプレートの期限まであと%i日です。今すぐ更新してください。
ko: 공휴일 템플릿이 %i일 후 만료됩니다. 지금 업데이트하세요.
zh_hans: 你的公共假期模板将在%i天后到期，请及时更新。
zh_hk: 你的公共假期模板將在%i天後到期，請及時更新。

# notification.type.template.title
source: Template Notification
ja: テンプレート通知
ko: 템플릿 알림
zh_hans: 模板通知
zh_hk: 模板通知

# notificationEditor.auth.needToSettings
source: Turn on Notifications in Settings
ja: 設定で通知を許可する
ko: 설정에서 알림 켜기
zh_hans: 前往设置允许通知权限
zh_hk: 前往設置以允許通知權限

# notificationEditor.auth.notDetermined
source: Turn on Notifications
ja: 通知を許可する
ko: 알림 켜기
zh_hans: 允许通知权限
zh_hk: 允許通知權限

# notificationEditor.customDay.fireTime
source: Notify me at
ja: 通知時刻
ko: 알림 시간
zh_hans: 通知时间
zh_hk: 通知時間

# notificationEditor.customDay.hint
source: Notifications are sent one day before the Custom Day starts (multi-day Custom Days notify only once).
ja: カスタム日の前日に通知します（複数日連続の場合は1回のみ）。
ko: 사용자 지정일 시작 하루 전에 알림을 보냅니다(여러 날 이어지는 사용자 지정일은 한 번만 알림).
zh_hans: 将会在自定义休息日/自定义工作日开始前一天通知用户（如果连续多日都是自定义休息日/自定义工作日，则只通知一次）
zh_hk: 將會在自定義休息日/自定義工作日開始前一天通知用戶（如果連續多日都是自定義休息日/自定義工作日，則只通知一次）

# notificationEditor.customDay.section
source: Custom Day Notifications
ja: カスタム日通知
ko: 사용자 지정일 알림
zh_hans: 自定义休息日/自定义工作日通知
zh_hk: 自定義休息日/自定義工作日通知

# notificationEditor.customDay.toggle
source: Enable Notifications
ja: 通知を有効にする
ko: 알림 활성화
zh_hans: 启用
zh_hk: 啟用

# notificationEditor.publicHoliday.fireTime
source: Notify me at
ja: 通知時刻
ko: 알림 시간
zh_hans: 通知时间
zh_hk: 通知時間

# notificationEditor.publicHoliday.hint
source: Notifications are sent one day before the Public Holiday starts (multi-day Public Holidays notify only once).
ja: 祝日の前日に通知します（複数日連続の場合は1回のみ）。
ko: 공휴일 시작 하루 전에 알림을 보냅니다(여러 날 이어지는 공휴일은 한 번만 알림).
zh_hans: 将会在公共假期/公共调班开始前一天通知用户（如果连续多日的公共假期名字相同，则只通知一次）
zh_hk: 將會在公共假期/公共調班開始前一天通知用戶（如果連續多日的公共假期名字相同，則只通知一次）

# notificationEditor.publicHoliday.section
source: Public Holiday Notifications
ja: 祝日通知
ko: 공휴일 알림
zh_hans: 公共假期/公共调班通知
zh_hk: 公共假期/公共調班通知

# notificationEditor.publicHoliday.toggle
source: Enable Notifications
ja: 通知を有効にする
ko: 알림 활성화
zh_hans: 启用
zh_hk: 啟用

# notificationEditor.template.fireTime
source: Notify me at
ja: 通知時刻
ko: 알림 시간
zh_hans: 通知时间
zh_hk: 通知時間

# notificationEditor.template.hint
source: Alerts begin 5 days before the Public Holiday Template expires.
ja: 祝日テンプレートの期限5日前からアラートを送信します。
ko: 공휴일 템플릿 만료 5일 전부터 알림을 보냅니다.
zh_hans: 将会在公共假期模板有效期到期前五天开始通知用户
zh_hk: 將會在公共假期模板有效期到期前五天開始通知用戶

# notificationEditor.template.section
source: Public Holiday Template Expiry Alerts
ja: 祝日テンプレート期限アラート
ko: 공휴일 템플릿 만료 알림
zh_hans: 公共假期模板过期通知
zh_hk: 公共假期模板過期通知

# notificationEditor.template.toggle
source: Enable Alerts
ja: アラートを有効にする
ko: 알림 활성화
zh_hans: 启用
zh_hk: 啟用

# notificationEditor.title
source: Manage Notifications
ja: 通知管理
ko: 알림 관리
zh_hans: 通知管理
zh_hk: 通知管理

# publicDay.alert.delete.cancel
source: Cancel
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hk: 取消

# publicDay.alert.delete.confirm
source: Delete
ja: 削除
ko: 삭제
zh_hans: 删除
zh_hk: 刪除

# publicDay.alert.delete.title
source: Would you like to delete this record?
ja: このレコードを削除しますか？
ko: 이 기록을 삭제할까요?
zh_hans: 你要删除这条记录吗？
zh_hk: 你要刪除這條記錄嗎？

# publicDay.alert.duplicate.title
source: There is a record already exists for this date.
ja: この日付にはすでにレコードが存在します。
ko: 이 날짜에는 이미 기록이 있습니다.
zh_hans: 该日期下已经存在记录
zh_hk: 該日期下已經存在記錄

# publicDay.cancel.title
source: Cancel
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hk: 取消

# publicDay.detail.date
source: Date
ja: 日付
ko: 날짜
zh_hans: 日期
zh_hk: 日期

# publicDay.detail.delete
source: Delete
ja: 削除
ko: 삭제
zh_hans: 删除
zh_hk: 刪除

# publicDay.detail.title.placeholder
source: Name
ja: 名前
ko: 이름
zh_hans: 名称
zh_hk: 名稱

# publicDay.detail.type
source: Type
ja: タイプ
ko: 유형
zh_hans: 类型
zh_hk: 類型

# publicDay.editor.add.title
source: Add
ja: 追加
ko: 추가
zh_hans: 新增
zh_hk: 新增

# publicDay.editor.title.add
source: Add Day
ja: 日付を追加
ko: 일 추가
zh_hans: 新增记录
zh_hk: 新增記錄

# publicDay.editor.title.update
source: Update Day
ja: 日付を更新
ko: 일 업데이트
zh_hans: 更新记录
zh_hk: 更新記錄

# publicDay.editor.update.title
source: Update
ja: 更新
ko: 업데이트
zh_hans: 更新
zh_hk: 更新

# publicDay.item.cn.guangxi
source: China Mainland Public Holiday (Guangxi Version)
ja: 中国大陸の祝日（広西版）
ko: 중국 본토 공휴일(광시 버전)
zh_hans: 广西壮族自治区节假日安排
zh_hk: 廣西壯族自治區節假日安排

# publicDay.item.cn.guangxi.subtitle
source: Cover 2024 - 2026
ja: 2024〜2026年
ko: 2024~2026년 지원
zh_hans: 覆盖2024-2026年
zh_hk: 涵蓋2024-2026年

# publicDay.item.cn.liangshan
source: China Mainland Public Holiday (Sichuan Liangshan Version)
ja: 中国大陸の祝日（四川涼山版）
ko: 중국 본토 공휴일(쓰촨 량산 버전)
zh_hans: 四川省凉山彝族自治州节假日安排
zh_hk: 四川省涼山彝族自治州節假日安排

# publicDay.item.cn.liangshan.subtitle
source: Cover 2026
ja: 2026年
ko: 2026년 지원
zh_hans: 覆盖2026年
zh_hk: 涵蓋2026年

# publicDay.item.cn.mainland
source: China Mainland Public Holiday
ja: 中国大陸の祝日
ko: 중국 본토 공휴일
zh_hans: 中国内地节假日安排
zh_hk: 中國內地節假日安排

# publicDay.item.cn.mainland.subtitle
source: Cover 2024 - 2026
ja: 2024〜2026年
ko: 2024~2026년 지원
zh_hans: 覆盖2024-2026年
zh_hk: 涵蓋2024-2026年

# publicDay.item.cn.ningxia
source: China Mainland Public Holiday (Ningxia Version)
ja: 中国大陸の祝日（寧夏版）
ko: 중국 본토 공휴일(닝샤 버전)
zh_hans: 宁夏回族自治区节假日安排
zh_hk: 寧夏回族自治區節假日安排

# publicDay.item.cn.ningxia.subtitle
source: Cover 2024 - 2026
ja: 2024〜2026年
ko: 2024~2026년 지원
zh_hans: 覆盖2024-2026年
zh_hk: 涵蓋2024-2026年

# publicDay.item.cn.xinjiang
source: China Mainland Public Holiday (Xinjiang Version)
ja: 中国大陸の祝日（新疆版）
ko: 중국 본토 공휴일(신장 버전)
zh_hans: 新疆维吾尔自治区节假日安排
zh_hk: 新疆維吾爾自治區節假日安排

# publicDay.item.cn.xinjiang.subtitle
source: Cover 2024 - 2026
ja: 2024〜2026年
ko: 2024~2026년 지원
zh_hans: 覆盖2024-2026年
zh_hk: 涵蓋2024-2026年

# publicDay.item.cn.xizang
source: China Mainland Public Holiday (Xizang Version)
ja: 中国大陸の祝日（チベット版）
ko: 중국 본토 공휴일(시짱 버전)
zh_hans: 西藏自治区节假日安排
zh_hk: 西藏自治區節假日安排

# publicDay.item.cn.xizang.subtitle
source: Cover 2024 - 2026
ja: 2024〜2026年
ko: 2024~2026년 지원
zh_hans: 覆盖2024-2026年
zh_hk: 涵蓋2024-2026年

# publicDay.item.hk
source: Hong Kong Public Holiday
ja: 香港の祝日
ko: 홍콩 공휴일
zh_hans: 香港公众假期
zh_hk: 香港公眾假期

# publicDay.item.hk.subtitle
source: Cover 2024 - 2026
ja: 2024〜2026年
ko: 2024~2026년 지원
zh_hans: 覆盖2024-2026年
zh_hk: 涵蓋2024-2026年

# publicDay.item.jp
source: Japan Public Holiday
ja: 日本の祝日・休日
ko: 일본 공휴일
zh_hans: 日本祝日·休日
zh_hk: 日本祝日·休日

# publicDay.item.jp.subtitle
source: Cover 1955 - 2026
ja: 1955〜2026年
ko: 1955~2026년 지원
zh_hans: 覆盖1955-2026年
zh_hk: 涵蓋1955-2026年

# publicDay.item.kr
source: Korean Public Holiday
ja: 韓国の祝日
ko: 한국 공휴일
zh_hans: 韩国法定节假日
zh_hk: 韓國法定節假日

# publicDay.item.kr.subtitle
source: Cover 2024 - 2026
ja: 2024〜2026年
ko: 2024~2026년 지원
zh_hans: 覆盖2024-2026年
zh_hk: 涵蓋2024-2026年

# publicDay.item.mo.cs
source: Macau Public Holiday with Public Administration Workers' Compensatory Holidays
ja: マカオの祝日（公共行政補償休暇付き）
ko: 마카오 공휴일(공공행정 직원 보상휴일 포함)
zh_hans: 澳门公众假期 + 公共行政工作人员补假日
zh_hk: 澳門公眾假期 + 公共行政工作人員補假日

# publicDay.item.mo.cs.subtitle
source: Cover 2024 - 2026
ja: 2024〜2026年
ko: 2024~2026년 지원
zh_hans: 覆盖2024-2026年
zh_hk: 涵蓋2024-2026年

# publicDay.item.mo.force
source: Macau Mandatory Holidays
ja: マカオの強制性休日
ko: 마카오 강제 휴일
zh_hans: 澳门强制性假日
zh_hk: 澳門強制性假日

# publicDay.item.mo.force.subtitle
source: Cover 2024 - 2026
ja: 2024〜2026年
ko: 2024~2026년 지원
zh_hans: 覆盖2024-2026年
zh_hk: 涵蓋2024-2026年

# publicDay.item.mo.public
source: Macau Public Holiday
ja: マカオの祝日
ko: 마카오 공휴일
zh_hans: 澳门公众假期
zh_hk: 澳門公眾假期

# publicDay.item.mo.public.subtitle
source: Cover 2024 - 2026
ja: 2024〜2026年
ko: 2024~2026년 지원
zh_hans: 覆盖2024-2026年
zh_hk: 涵蓋2024-2026年

# publicDay.item.sg
source: Singapore Public Holiday
ja: シンガポールの祝日
ko: 싱가포르 공휴일
zh_hans: 新加坡公共假期
zh_hk: 新加坡公共假期

# publicDay.item.sg.subtitle
source: Cover 2024 - 2026
ja: 2024〜2026年
ko: 2024~2026년 지원
zh_hans: 覆盖2024-2026年
zh_hk: 涵蓋2024-2026年

# publicDay.item.special.create
source: New Template...
ja: 新しいテンプレート…
ko: 새 템플릿...
zh_hans: 创建模板…
zh_hk: 創建模板…

# publicDay.item.special.empty
source: No Template
ja: テンプレートなし
ko: 템플릿 없음
zh_hans: 无
zh_hk: 無

# publicDay.item.special.import
source: Import Template...
ja: テンプレートをインポート…
ko: 템플릿 가져오기...
zh_hans: 导入模板…
zh_hk: 導入模板…

# publicDay.item.special.subscribe
source: Subscribe URL...
ja: URLを購読…
ko: URL 구독...
zh_hans: 订阅 URL…
zh_hk: 訂閱 URL…

# publicDay.item.th
source: Thailand Public Holiday
ja: タイの祝日
ko: 태국 공휴일
zh_hans: 泰国公共假期
zh_hk: 泰國公共假期

# publicDay.item.th.subtitle
source: Cover 2024 - 2026
ja: 2024〜2026年
ko: 2024~2026년 지원
zh_hans: 覆盖2024-2026年
zh_hk: 涵蓋2024-2026年

# publicDay.item.us
source: US Federal Holidays
ja: 米国連邦祝日
ko: 미국 연방 공휴일
zh_hans: 美国联邦假日
zh_hk: 美國聯邦假日

# publicDay.item.us.subtitle
source: Cover 2024 - 2026
ja: 2024〜2026年
ko: 2024~2026년 지원
zh_hans: 覆盖2024-2026年
zh_hk: 涵蓋2024-2026年

# publicDetail.alert.cancel
source: Cancel
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hk: 取消

# publicDetail.alert.title
source: Please Input Title
ja: タイトルを入力してください
ko: 제목을 입력하세요
zh_hans: 请输入标题
zh_hk: 請輸入標題

# publicDetail.button.delete
source: Delete Template
ja: テンプレートを削除
ko: 템플릿 삭제
zh_hans: 删除模板
zh_hk: 刪除模板

# publicDetail.button.new
source: Add Day
ja: 日付を追加
ko: 일 추가
zh_hans: 新增记录
zh_hk: 新增記錄

# publicDetail.button.pause
source: Pause Subscription
ja: 購読を一時停止
ko: 구독 일시 중지
zh_hans: 暂停订阅
zh_hk: 暫停訂閱

# publicDetail.button.refresh
source: Refresh Subscription
ja: 購読を更新
ko: 구독 새로 고침
zh_hans: 刷新订阅
zh_hk: 刷新訂閱

# publicDetail.button.resume
source: Resume Subscription
ja: 購読を再開
ko: 구독 재개
zh_hans: 恢复订阅
zh_hk: 恢復訂閱

# publicDetail.cancel.title
source: Cancel
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hk: 取消

# publicDetail.close.title
source: Close
ja: 閉じる
ko: 닫기
zh_hans: 关闭
zh_hk: 關閉

# publicDetail.create.title
source: Duplicate for Custom
ja: カスタム用に複製
ko: 사용자 지정으로 복제
zh_hans: 新建自定义副本
zh_hk: 新建自訂副本

# publicDetail.end
source: End Date
ja: 終了日
ko: 종료일
zh_hans: 结束日期
zh_hk: 結束日期

# publicDetail.import.failure
source: Import Failure
ja: インポート失敗
ko: 가져오기 실패
zh_hans: 导入失败
zh_hk: 導入失敗

# publicDetail.import.success
source: Import Success
ja: インポート成功
ko: 가져오기 성공
zh_hans: 导入成功
zh_hk: 導入成功

# publicDetail.lastRefreshTime
source: Last Updated
ja: 最終更新
ko: 마지막 업데이트
zh_hans: 上次更新
zh_hk: 上次更新

# publicDetail.newYear.name
source: New Year's Day
ja: 元日
ko: 신정
zh_hans: 元旦
zh_hk: 元旦

# publicDetail.note
source: Note
ja: メモ
ko: 메모
zh_hans: 备注
zh_hk: 備註

# publicDetail.note.alert.title
source: Edit Note
ja: メモを編集
ko: 메모 편집
zh_hans: 编辑备注
zh_hk: 編輯備註

# publicDetail.note.empty
source: Add note...
ja: メモを追加…
ko: 메모 추가...
zh_hans: 添加备注…
zh_hk: 添加備註…

# publicDetail.save.title
source: Save
ja: 保存
ko: 저장
zh_hans: 保存
zh_hk: 保存

# publicDetail.sourceURL
source: Source
ja: ソース
ko: 출처
zh_hans: 来源
zh_hk: 來源

# publicDetail.sourceURL.copy
source: Copy URL
ja: URLをコピー
ko: URL 복사
zh_hans: 复制链接
zh_hk: 複製連結

# publicDetail.start
source: Start Date
ja: 開始日
ko: 시작일
zh_hans: 起始日期
zh_hk: 起始日期

# publicDetail.title.new
source: New Template
ja: 新しいテンプレート
ko: 새 템플릿
zh_hans: 新建模板
zh_hk: 新建模板

# publicPlan.alert.dateError.message
source: The Start Date cannot be later than the End Date.
ja: 開始日は終了日より後に設定できません。
ko: 시작일은 종료일보다 늦을 수 없습니다.
zh_hans: 起始日期不能晚于结束日期。
zh_hk: 起始日期不能晚於結束日期。

# publicPlan.alert.dateError.title
source: Invalid Date
ja: 無効な日付
ko: 잘못된 날짜
zh_hans: 日期无效
zh_hk: 日期無效

# publicPlan.alert.delete.cancel
source: Cancel
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hk: 取消

# publicPlan.alert.delete.confirm
source: Delete
ja: 削除
ko: 삭제
zh_hans: 删除
zh_hk: 刪除

# publicPlan.alert.delete.title
source: Would you like to delete this template?
ja: このテンプレートを削除しますか？
ko: 이 템플릿을 삭제할까요?
zh_hans: 你要删除这个模板吗？
zh_hk: 你要刪除這個模板嗎？

# publicPlan.lastRefresh.indicator
source: Updated: %@
ja: 更新日時：%@
ko: 업데이트됨: %@
zh_hans: 更新于 %@
zh_hk: 更新於 %@

# publicPlan.pause.title
source: Pause
ja: 一時停止
ko: 일시 중지
zh_hans: 暂停订阅
zh_hk: 暫停訂閱

# publicPlan.paused.indicator
source: Paused
ja: 一時停止中
ko: 일시 중지됨
zh_hans: 已暂停
zh_hk: 已暫停

# publicPlan.refresh.title
source: Refresh
ja: 更新
ko: 새로 고침
zh_hans: 刷新
zh_hk: 刷新

# publicPlan.resume.title
source: Resume
ja: 再開
ko: 재개
zh_hans: 恢复订阅
zh_hk: 恢復訂閱

# publicPlan.share.title
source: Share
ja: 共有
ko: 공유
zh_hans: 分享
zh_hk: 分享

# publicPlan.subscribe.alert.cancel
source: Cancel
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hk: 取消

# publicPlan.subscribe.alert.confirm
source: Subscribe
ja: 購読
ko: 구독
zh_hans: 订阅
zh_hk: 訂閱

# publicPlan.subscribe.alert.message
source: Enter the URL of a holiday plan JSON file
ja: 祝日テンプレートのJSON URLを入力
ko: 공휴일 템플릿 JSON 파일의 URL을 입력하세요
zh_hans: 输入公共假期模板 JSON 文件的 URL
zh_hk: 輸入公共假期模板 JSON 檔案的 URL

# publicPlan.subscribe.alert.title
source: Subscribe to Plan
ja: テンプレートを購読
ko: 템플릿 구독
zh_hans: 订阅模板
zh_hk: 訂閱模板

# publicPlan.subscribe.duplicate.message
source: This URL is already subscribed. Each URL can only have one subscription.
ja: このURLはすでに購読中です。同じURLには1件の購読のみ設定できます。
ko: 이 URL은 이미 구독 중입니다. 각 URL은 하나의 구독만 가질 수 있습니다.
zh_hans: 该 URL 已被订阅，同一个 URL 只能存在一个订阅。
zh_hk: 該 URL 已被訂閱，同一個 URL 只能存在一個訂閱。

# publicPlan.subscribe.duplicate.title
source: Already Subscribed
ja: 購読済み
ko: 이미 구독 중
zh_hans: 已订阅
zh_hk: 已訂閱

# publicPlan.subscribe.failure
source: Failed to subscribe
ja: 購読失敗
ko: 구독 실패
zh_hans: 订阅失败
zh_hk: 訂閱失敗

# publicPlan.subscribe.success
source: Subscribed successfully
ja: 購読しました
ko: 구독했습니다
zh_hans: 订阅成功
zh_hk: 訂閱成功

# settings.alternativeCalendarType.chineseCalendar
source: Chinese Calendar
ja: 中国暦
ko: 중국력
zh_hans: 中国农历
zh_hk: 中國農曆

# settings.alternativeCalendarType.footer
source: Alternative Calendar information will be displayed below the date.
ja: 代替カレンダーの情報が日付の下に表示されます。
ko: 대체 캘린더 정보가 날짜 아래에 표시됩니다.
zh_hans: 其他日历信息将会显示在日期下方。
zh_hk: 其他日曆信息將會顯示在日期下方。

# settings.alternativeCalendarType.off
source: Off
ja: オフ
ko: 꺼짐
zh_hans: 关闭
zh_hk: 關閉

# settings.alternativeCalendarType.title
source: Alternative Calendar
ja: 代替カレンダー
ko: 대체 캘린더
zh_hans: 其他历法
zh_hk: 其他日曆

# settings.holidayWorkColorType.paper
source: Empty
ja: なし
ko: 없음
zh_hans: 一般背景色
zh_hk: 一般背景色

# settings.holidayWorkColorType.title
source: Holiday Work Shift Color
ja: 振替出勤日の色
ko: 공휴일 근무일 색상
zh_hans: 假期调班颜色
zh_hk: 假期調班顏色

# settings.holidayWorkColorType.workDay
source: Red
ja: 赤
ko: 빨간색
zh_hans: 红色
zh_hk: 紅色

# settings.logEntrance.hidden
source: Hidden
ja: 非表示
ko: 숨김
zh_hans: 隐藏
zh_hk: 隱藏

# settings.logEntrance.tab
source: Show
ja: 表示
ko: 표시
zh_hans: 显示
zh_hk: 顯示

# settings.logEntrance.title
source: Log Tab
ja: ログタブ
ko: 로그 탭
zh_hans: 日志标签页
zh_hk: 日誌標籤頁

# settings.logo.footer
source: The "Classic" option restores the icons used in versions prior to 1.6.7.
ja: 「クラシック」は1.6.7以前のアイコンに戻す設定です。
ko: "클래식" 옵션은 1.6.7 이전 버전에서 사용하던 아이콘으로 되돌립니다.
zh_hans: “经典”选项是恢复1.6.7之前版本使用的图标。
zh_hk: “經典”選項是恢復1.6.7之前版本使用的圖標。

# settings.logo.title
source: App Icon
ja: Appアイコン
ko: 앱 아이콘
zh_hans: App图标
zh_hk: App圖標

# settings.logRetention.disabled
source: Disabled
ja: 無効
ko: 비활성화
zh_hans: 不记录
zh_hk: 不記錄

# settings.logRetention.footer
source: Choose how many of the most recent log entries to keep. Older entries are automatically removed. Selecting Disabled only stops new logs from being written; existing logs are kept. Clear them manually from the Log page if needed.
ja: 保持する最新のログ件数を選択します。古いエントリは自動的に削除されます。「無効」を選択した場合は新規ログの書き込みのみ停止され、既存のログは保持されます。必要に応じてログページから手動で削除してください。
ko: 보관할 최신 로그 항목 수를 선택합니다. 오래된 항목은 자동으로 삭제됩니다. 비활성화를 선택하면 새 로그 작성만 중지되며 기존 로그는 유지됩니다. 필요한 경우 로그 페이지에서 수동으로 지우세요.
zh_hans: 选择保留的最近日志条数，超出部分会自动清理。选择「不记录」仅会停止写入新日志，已有日志仍会保留，如需清空请前往日志页面手动操作。
zh_hk: 選擇保留的最近日誌條數，超出部分會自動清理。選擇「不記錄」僅會停止寫入新日誌，既有日誌仍會保留，如需清空請前往日誌頁面手動操作。

# settings.logRetention.oneHundred
source: 100 entries
ja: 100件
ko: 100개 항목
zh_hans: 100 条
zh_hk: 100 條

# settings.logRetention.tenThousand
source: 10,000 entries
ja: 10,000件
ko: 10,000개 항목
zh_hans: 10000 条
zh_hk: 10000 條

# settings.logRetention.title
source: Log Retention
ja: ログ保持
ko: 로그 보관
zh_hans: 日志存储
zh_hk: 日誌儲存

# settings.logRetention.unlimited
source: Unlimited
ja: 無制限
ko: 무제한
zh_hans: 无限制
zh_hk: 無限制

# settings.tutorialEntranceType.first
source: First Tab
ja: 1番目のタブ
ko: 첫 번째 탭
zh_hans: 第一个标签页
zh_hk: 第一個標籤頁

# settings.tutorialEntranceType.hidden
source: Hidden
ja: 非表示
ko: 숨김
zh_hans: 隐藏
zh_hk: 隱藏

# settings.tutorialEntranceType.second
source: Second Tab
ja: 2番目のタブ
ko: 두 번째 탭
zh_hans: 第二个标签页
zh_hk: 第二個標籤頁

# settings.tutorialEntranceType.title
source: Tutorial Entrance
ja: チュートリアルの入口
ko: 튜토리얼 진입점
zh_hans: 教程位置
zh_hk: 教程位置

# settings.weekEndColorType.blue
source: Blue
ja: 青
ko: 파란색
zh_hans: 蓝色
zh_hk: 藍色

# settings.weekEndColorType.offDay
source: Green
ja: 緑
ko: 초록색
zh_hans: 绿色
zh_hk: 綠色

# settings.weekEndColorType.title
source: Base Off Day Color
ja: ベース休日の色
ko: 기본 휴일 색상
zh_hans: 基础休息日颜色
zh_hk: 基礎休息日顏色

# settings.weekEndOffDayType.footer
source: Weekend(s) will be considered as Off Day(s).
ja: 選択した週末が休日として設定されます。
ko: 주말은 휴일로 간주됩니다.
zh_hans: 单休/双休的选择，会直接影响休息日的判断。
zh_hk: 單休/雙休的選擇，會直接影響休息日的判斷。

# settings.weekEndOffDayType.one
source: Sunday
ja: 日曜
ko: 일요일
zh_hans: 单休
zh_hk: 單休

# settings.weekEndOffDayType.title
source: Weekend Type
ja: 週末タイプ
ko: 주말 유형
zh_hans: 周末类型
zh_hk: 週末類型

# settings.weekEndOffDayType.two
source: Saturday + SunDay
ja: 土日
ko: 토요일 + 일요일
zh_hans: 双休
zh_hk: 雙休

# settings.weekEndOffDayType.zero
source: None
ja: なし
ko: 없음
zh_hans: 无休
zh_hk: 無休

# settings.weekStartType.followSystem
source: Follow System
ja: システムに従う
ko: 시스템 설정 따르기
zh_hans: 跟随系统
zh_hk: 跟隨系統

# settings.weekStartType.title
source: First Day of Week
ja: 週の最初の曜日
ko: 주의 시작 요일
zh_hans: 每周第一天
zh_hk: 一週的第一日

# solarTerm.2
source: 惊蛰
ja: 啓蟄
ko: 경칩
zh_hk: 驚蟄

# solarTerm.5
source: 谷雨
ja: 穀雨
ko: 곡우
zh_hk: 穀雨

# solarTerm.7
source: 小满
ja: 小満
ko: 소만
zh_hk: 小滿

# solarTerm.8
source: 芒种
ja: 芒種
ko: 망종
zh_hk: 芒種

# solarTerm.13
source: 处暑
ja: 処暑
ko: 처서
zh_hk: 處暑

# subscription.preview.accept
source: Accept
ja: 適用
ko: 적용
zh_hans: 接受
zh_hk: 接受

# subscription.preview.change.end
source: End: %@ → %@
ja: 終了日：%@ → %@
ko: 종료일: %@ → %@
zh_hans: 结束日期：%@ → %@
zh_hk: 結束日期：%@ → %@

# subscription.preview.change.note
source: Note updated
ja: メモを更新しました
ko: 메모가 업데이트됨
zh_hans: 备注已更新
zh_hk: 備註已更新

# subscription.preview.change.start
source: Start: %@ → %@
ja: 開始日：%@ → %@
ko: 시작일: %@ → %@
zh_hans: 起始日期：%@ → %@
zh_hk: 起始日期：%@ → %@

# subscription.preview.decline
source: Decline
ja: 拒否
ko: 거절
zh_hans: 不接受
zh_hk: 不接受

# subscription.preview.decline.cancel
source: Cancel
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hk: 取消

# subscription.preview.decline.pause
source: Pause Subscription
ja: 購読を一時停止
ko: 구독 일시 중지
zh_hans: 暂停订阅
zh_hk: 暫停訂閱

# subscription.preview.decline.skip
source: Skip This Version
ja: このバージョンをスキップ
ko: 이 버전 건너뛰기
zh_hans: 跳过这一版更新
zh_hk: 跳過這一版更新

# subscription.update.alert.cancel
source: Cancel
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hk: 取消

# subscription.update.alert.message
source: A new version is available for review.
ja: 確認可能な新しいバージョンがあります。
ko: 검토할 수 있는 새 버전이 있습니다.
zh_hans: 有新的版本可供查看。
zh_hk: 有新的版本可供查看。

# subscription.update.alert.preview
source: Preview
ja: プレビュー
ko: 미리 보기
zh_hans: 预览
zh_hk: 預覽

# subscription.update.alert.title
source: Template "%@" Update
ja: テンプレート「%@」の更新
ko: 템플릿 "%@" 업데이트
zh_hans: 模板「%@」更新
zh_hk: 模板「%@」更新

# subscription.update.notification.body
source: A new version is available for review.
ja: 確認可能な新しいバージョンがあります。
ko: 검토할 수 있는 새 버전이 있습니다.
zh_hans: 有新的版本可供查看。
zh_hk: 有新的版本可供查看。

# subscription.update.notification.title
source: "%@" has an update
ja: 「%@」が更新されました
ko: "%@"에 업데이트가 있습니다
zh_hans: 「%@」有更新
zh_hk: 「%@」有更新

# tutorials.authFailed.action
source: Jump to Settings
ja: 設定へ
ko: 설정으로 이동
zh_hans: 前往设置
zh_hk: 前往設置

# tutorials.automation.subtitle
source: Tap to Tutorials
ja: タップしてチュートリアルを見る
ko: 탭하여 튜토리얼 보기
zh_hans: 点击查看教程
zh_hk: 點擊查看教程

# tutorials.automation.title
source: Enable Automation
ja: 自動化を有効にする
ko: 자동화 활성화
zh_hans: 开启自动化
zh_hk: 開啟自動化

# tutorials.hint.second
source: 'No Alarms on Off Days!'
ja: 「休日はアラームを鳴らさない！」
ko: '휴일에는 알람 없음!'
zh_hans: “休息日闹钟不响！”
zh_hk: “休息日鬧鐘不響！”

# tutorials.hint.top
source: Our Goal is ...
ja: 私たちの目標は…
ko: 우리의 목표는...
zh_hans: 我们的目标是：
zh_hk: 我們的目標是：

# tutorials.normal.title
source: For Normal Alarms
ja: 通常アラーム用
ko: 일반 알람용
zh_hans: 用于一般闹钟
zh_hk: 用於一般鬧鐘

# tutorials.notification.subtitle
source: Tap to Get Notifications before Public Holidays Begin
ja: タップして祝日前の通知を設定
ko: 탭하여 공휴일 시작 전에 알림 받기
zh_hans: 点击启用通知
zh_hk: 點擊啟用通知

# tutorials.notification.title
source: Enable Public Holiday Notifications
ja: 祝日通知を有効にする
ko: 공휴일 알림 활성화
zh_hans: 启用公共假期提前通知
zh_hk: 啟用公共假期提前通知

# tutorials.publicPlan.subtitle
source: Tap to Choose
ja: タップして選択
ko: 탭하여 선택
zh_hans: 点击选择
zh_hk: 點擊選擇

# tutorials.publicPlan.title
source: Choose Public Holiday Template
ja: 祝日テンプレートを選択
ko: 공휴일 템플릿 선택
zh_hans: 选择公共假期模板
zh_hk: 選擇公共假期模板

# tutorials.shortcuts.help.title
source: Shortcuts Tutorials
ja: ショートカットチュートリアル
ko: 단축어 튜토리얼
zh_hans: 快捷指令教程
zh_hk: 捷徑教程

# tutorials.shortcuts.subtitle
source: Tap to Add
ja: タップして追加
ko: 탭하여 추가
zh_hans: 点击添加
zh_hk: 點擊添加

# tutorials.shortcuts.title
source: Add Shortcuts
ja: ショートカットを追加
ko: 단축어 추가
zh_hans: 添加快捷指令
zh_hk: 添加捷徑

# tutorials.sleep.title
source: For Sleep Alarms
ja: 睡眠アラーム用
ko: 수면 알람용
zh_hans: 用于睡眠闹钟
zh_hk: 用於睡眠鬧鐘

# Update Day Mark of ${date} to ${mark}?
source: Update User Annotation of ${date} to ${mark}?
ja: ${date}のユーザー注釈を${mark}に更新しますか？
ko: ${date}의 사용자 주석을 ${mark}(으)로 업데이트할까요?
zh_hans: 将${date}用户标注更新为${mark}？
zh_hk: 將${date}用戶標註更新為${mark}？

# weekCalendar.today
source: Today
ja: 今日
ko: 오늘
zh_hans: 今天
zh_hk: 今日

source: Which Day?
ja: どの日？
ko: 어느 날?
zh_hans: 哪一天？
zh_hk: 哪一日？

# button.ok
source: OK
ko: 확인
zh_hans: 好的
zh_hk: 好的

# publicDay.alert.duplicate.cancel
source: OK
ko: 확인
zh_hans: 好的
zh_hk: 好的

# publicDetail.alert.confirm
source: OK
ko: 확인
zh_hans: 好的
zh_hk: 好的

# publicPlan.alert.dateError.cancel
source: OK
ko: 확인
zh_hans: 好的
zh_hk: 好的

# solarTerm.0
source: 立春
ko: 입춘

# solarTerm.1
source: 雨水
ko: 우수

# solarTerm.3
source: 春分
ko: 춘분

# solarTerm.4
source: 清明
ko: 청명

# solarTerm.6
source: 立夏
ko: 입하

# solarTerm.9
source: 夏至
ko: 하지

# solarTerm.10
source: 小暑
ko: 소서

# solarTerm.11
source: 大暑
ko: 대서

# solarTerm.12
source: 立秋
ko: 입추

# solarTerm.14
source: 白露
ko: 백로

# solarTerm.15
source: 秋分
ko: 추분

# solarTerm.16
source: 寒露
ko: 한로

# solarTerm.17
source: 霜降
ko: 상강

# solarTerm.18
source: 立冬
ko: 입동

# solarTerm.19
source: 小雪
ko: 소설

# solarTerm.20
source: 大雪
ko: 대설

# solarTerm.21
source: 冬至
ko: 동지

# solarTerm.22
source: 小寒
ko: 소한

# solarTerm.23
source: 大寒
ko: 대한

# log.detail.type.intent
source: App Intent
zh_hans: 快捷指令
zh_hk: 捷徑指令
